Revit 2024 API
BuiltInFailures.StairRampFailures.StringerCurveTooShort Property
 A piece of boundary is too short to create stringer on it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StringerCurveTooShort { get; }
Visual Basic
Public Shared ReadOnly Property StringerCurveTooShort As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StringerCurveTooShort {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace